Тест/Тест/src/DataProcessors/ПроверкаДеталиНаЛиквидПоНомеруПроизводителя/ПроверкаДеталиНаЛиквидПоНомеруПроизводителя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПроверкаДеталиНаЛиквидПоНомеруПроизводителя</name>
</mdclass:DataProcessor>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/DataProcessors/ПроверкаДеталиНаЛиквидПоНомеруПроизводителя/Forms/Форма/Module.bsl
&НаСервере
Процедура НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоСпросили,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Спрос
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказКлиентаТовары.Номенклатура.НомерПроизводителя = &НомерПроизводителя
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрНоменклатура.Ссылка КАК Деталь,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(РегистрНакопления1Остатки.КолвоОстаток, 0) КАК КолвоОстаток,
	|	(ЕСТЬNULL(Продажи.Количество, 0) + ЕСТЬNULL(ВТ_Спрос.КоличествоСпросили, 0)) * 2 КАК НеобходимыйОстаток
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО (РегистрНакопления1Остатки.Товар = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО (Продажи.Номенклатура = СпрНоменклатура.Ссылка)
	|			И (ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ПродажаЗапчастей).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Спрос КАК ВТ_Спрос
	|		ПО (ВТ_Спрос.Номенклатура = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	СпрНоменклатура.НомерПроизводителя = &НомерПроизводителя
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания,
	|	НеобходимыйОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("НомерПроизводителя", НомерПроизводителя);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 31536000));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Элементы.Результат.Заголовок =  "Можно учесть. Детали с таким номером производителя нет.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Номенклатура = Выборка.Деталь;
	ОстатокНаСкладах  = Строка(Выборка.КолвоОстаток);
	МинимальныйЗапас = Строка(Выборка.НеобходимыйОстаток);
	
	Если (ТекущаяДата() - Выборка.ДатаСоздания) <= (31536000 * 2) Тогда
		Элементы.Результат.Заголовок = "Можно учесть.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
	Иначе 
		Если Выборка.КолвоОстаток > Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Нельзя учесть. Количество на складе превышает необходимый запас.";
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		ИначеЕсли Выборка.НеобходимыйОстаток = 0 И Выборка.КолвоОстаток < 10 Тогда 
			Элементы.Результат.Заголовок =  "Можно учесть. Необходимый запас 0, но нужно минимум 10 шт.";
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		ИначеЕсли Выборка.КолвоОстаток <  Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Можно учесть. Остаток на складе меньше необходимого запаса."; 
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Иначе 
			Элементы.Результат.Заголовок =  "Нельзя учесть. Необходимый запас 0. А количество на складе - " + Выборка.КолвоОстаток;
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПроизводителяПриИзменении(Элемент)
	Элементы.Результат.Заголовок = "";
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ОстатокНаСкладах = 0;
	МинимальныйЗапас = 0;
	Если НомерПроизводителя = "" Тогда  
		Возврат;
	КонецЕсли;
	НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя);
КонецПроцедуры
